{
    "title": "Coach Josh Fabia Says UFC's Dana White, Sean Shelby Sleep with Female Fighters",
    "text": "Mike Roach/Zuffa LLC via Getty Images\n\nJoshua Fabia, the head coach of former UFC fighter Diego Sanchez, accused UFC President Dana White and matchmaker Sean Shelby of sleeping with female fighters.\n\n“Why isn’t nobody talking about, that the reckoning happened, and somehow Dana White gets to f--k fighters?” Fabia told John Gibson for his True Story YouTube interview series. “How many female fighters has he had sex with? How many female fighters has Sean Shelby had sex with? Yeah, this is the truth, man!\n\n“And so, let’s just get real: Here’s a lot of dirty, ridiculousness, and if you don’t want to clean it up or address it, and do this, yeah, man—I do have to show videos. I do have to show things because nobody else has recorded anything. Nobody else has protected themselves. Nobody else protected their fighter.”\n\nSanchez was released from his UFC contract last month after 16 years with the promotion. Fabia and Sanchez have released recordings of conversations they've had with UFC management, accusing them of trying to \"bully\" him into waiving his medical rights.\n\nSanchez was originally slated to face Donald Cerrone at UFC on ESPN 24 this weekend. However, UFC pulled him from the fight and then released him for undisclosed reasons. Sanchez had been with the UFC since winning the original Ultimate Fighter competition in 2005.\n\nWhite, who has not commented on Fabia's accusations regarding him sleeping with female fighters, called Fabia \"bats--t nuts\" in an interview with Kevin Iole of Yahoo Sports last month.\n\n“Somehow, this creep got into Diego’s life and has been controlling him,\" White said. \"You saw the video of him chasing guys in the Octagon with a knife. How f--king nuts is that? He goes to the commission and tells them that he’s taught Diego this death touch. It goes on and on with this guy. He goes into the [fighter-broadcaster] production meeting and tells the commentators what they should be saying? The guy is bats--t nuts. He worked his way into Diego’s life and has gotten control over him. I just want the best for Diego.”\n\nWhite said he and Sanchez had a good relationship before Fabia began coaching the welterweight. Fabia is known for using odd training methods; he released a video of him punching an upside-down Sanchez this week.",
    "authors": [
        "Tyler Conway"
    ],
    "date": ""
}