{
    "title": "Wells Fargo Championship 2021: Keith Mitchell Takes 2-Stroke Lead into Final Round",
    "text": "Maddie Meyer/Getty Images\n\nThe 2021 Wells Fargo Championship is going to come down to the wire Sunday with Keith Mitchell trying to hold off a host of challengers.\n\nMitchell posted the lowest score of the third round with a five-under 66. He has already posted more rounds under 70 (two) this weekend than he did in each of his previous two tournaments combined (one).\n\nChasing Mitchell at the top is Rory McIlroy, who moved into a tie with Gary Woodland for second place. The 32-year-old is only two shots back at seven under par. Another strong showing in the final round could end his 16-month winless streak.\n\n2021 Wells Fargo Championship Leaderboard\n\n1. Keith Mitchell (-9)\n\nT2. Gary Woodland (-7)\n\nT2. Rory McIlroy (-7)\n\n4. Luke List (-6)\n\nT5. Satoshi Kodaira (-5)\n\nT5. Scott Stallings (-5)\n\nT7. Abraham Ancer (-4)\n\nT7. Jason Dufner (-4)\n\nT7. Viktor Hovland (-4)\n\nT7. Kyle Stanley (-4)\n\nT7. Patrick Reed (-4)\n\nMitchell ascended into the lead by playing his first bogey-free round of the weekend. The 29-year-old racked up five birdies Saturday, including three on the back nine.\n\nAfter making the turn at two under, Mitchell looked to be in trouble when his second shot on No. 10 landed in the bunker on the left side of the green. He saved it by getting within eight feet of the hole on his next shot, followed by a birdie putt after that.\n\nMitchell stretched his lead to two shots with a four-foot birdie putt on No. 16.\n\nThis weekend has been an unexpected turnaround for Mitchell. He entered the Wells Fargo Championship coming off a 69th-place finish at the Valspar Championship last week and no top-10 finishes all season.\n\nComing on quick in Mitchell's rearview mirror is McIlroy. The Irish superstar has also been a surprise contender based on his recent performance, which included back-to-back missed cuts at The Players Championship and the Masters.\n\nMcIlroy made a hard charge on the front nine with four birdies to make the turn at eight under par.\n\nThe lone blemish on McIlroy's Saturday scorecard was a big one. He made double-bogey on the par-four 12th hole. His tee shot landed didn't even land in the rough, it was so far off the path.\n\nAfter getting onto the green in three, McIlroy missed two putts within 10 feet to take a six. It was a surprising moment because he had been so efficient on the green in the third round up to that point.\n\nMcIlroy did get one of those shots back with a birdie on No. 15 that brought his overall score to seven under par.\n\nThe PGA Tour showed a video detailing the differences in McIlroy's swing from January to today:\n\nThe effort is clearly paying off, as McIlroy has an opportunity to win this weekend. Regardless of the outcome, he's building positive momentum leading into the PGA Championship in two weeks.\n\nWoodland, who was tied with Mitchell for the lead through two rounds, is still in the mix. He's currently tied with McIlroy for second place after finishing Saturday one under par.\n\nWoodland briefly moved ahead of Mitchell for the top spot when he made a birdie on No. 3.\n\nLike Mitchell and McIlroy, Woodland has been trying to figure out his game recently. The University of Kansas alum didn't break par in four rounds at the Masters and missed the cut at the Valspar Championship because of an opening-round 77.\n\nThere's a large group of players chasing that trio heading into Sunday. Luke List is only one shot behind McIlroy and Woodland. Eight other players are four under par or better.\n\nThe stage is set for a dramatic finish at Quail Hollow Club.",
    "authors": [
        "Adam Wells"
    ],
    "date": ""
}